_posts/2022-01-23-boj-1493.html
---
title: BOJ 1493 박스 채우기
tags: 분할정복
---

<div id="outline-container-org64fda98" class="outline-2">
<h2 id="org64fda98">BOJ 1493 박스채우기</h2>
</div>

<div id="outline-container-org2c451f0" class="outline-2">
<h2 id="org2c451f0">접근하기</h2>
<div class="outline-text-2" id="text-org2c451f0">
<pre class="example">
입체 박스에서 정육면체를 하나 떼어내면, 3방향이 나옴

3방향은 작아진 박스가 나옴 -&gt; 분할정복으로 표현이 됨

</pre>
</div>
</div>

<div id="outline-container-orgddab8f9" class="outline-2">
<h2 id="orgddab8f9">코드</h2>
<div class="outline-text-2" id="text-orgddab8f9">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">L</span>, <span style="color: #ff6347;">W</span>, <span style="color: #ff6347;">H</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">length</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span>;
<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cube</span>[22];
<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">failed</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">length</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">width</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">height</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (length == 0 || width == 0 || height == 0) <span style="color: #729fcf; font-weight: bold;">return</span>;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=idx;i&gt;=0;i--) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (cube[i].cnt &gt; 0 &amp;&amp; (cube[i].length &lt;= length &amp;&amp; cube[i].length &lt;= width &amp;&amp; cube[i].length &lt;= height)) {
            cube[i].cnt -= 1;
            ans += 1;
            f(cube[i].length, width - cube[i].length, cube[i].length, i);
            f(length - cube[i].length, width, cube[i].length, i);
            f(length, width, height - cube[i].length, i);
            <span style="color: #729fcf; font-weight: bold;">return</span>;
        }
    }
    failed = <span style="color: #8ae234;">true</span>;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;L, &amp;W, &amp;H);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span>, <span style="color: #ff6347;">cnt</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;len, &amp;cnt);
        cube[i].length = (1 &lt;&lt; len);
        cube[i].cnt = cnt;
    }

    f(L, W, H, N-1);
    <span style="color: #729fcf; font-weight: bold;">if</span> (failed) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"-1\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf99e2b" class="outline-2">
<h2 id="orgdf99e2b">문제 링크</h2>
<div class="outline-text-2" id="text-orgdf99e2b">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1493">https://www.acmicpc.net/problem/1493</a></li>
</ul>
</div>
</div>

<div id="outline-container-org46f6843" class="outline-2">
<h2 id="org46f6843">설명/코드 참고</h2>
<div class="outline-text-2" id="text-org46f6843">
<ul class="org-ul">
<li><a href="https://velog.io/@hhj3258/%EB%B0%B1%EC%A4%80%EB%B6%84%ED%95%A0%EC%A0%95%EB%B3%B5C-1493%EB%B2%88-%EB%B0%95%EC%8A%A4-%EC%B1%84%EC%9A%B0%EA%B8%B0">jjh3258 설명</a></li>
</ul>
</div>
</div>
